[{"id": "1709497516728", "text": "View the video prototype here.", "answers": ["Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done"], "selected": false}, {"id": "1709497571641", "text": "Access and interact with the final prototype here.", "answers": ["Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done", "Done"], "selected": false}, {"id": "1709497665153", "text": "The user is able to customize subtitle appearance more easily with the new design alternatives.", "answers": ["4", "5", "4", "4", "5", "5", "5", "4", "5", "5", "4", "4", "5"], "selected": false}, {"id": "1709498009981", "text": "The underlined caption icon is a discoverable and easily understandable way to tell if captions are enabled/disabled.", "answers": ["5", "5", "4", "4", "5", "5", "2", "4", "4", "4", "4", "4", "5"], "selected": false}, {"id": "1709498545409", "text": "The keyboard shortcut 'c' is an appropriate way for the user to enable/disable captions.", "answers": ["3", "4", "4", "4", "5", "4", "4", "4", "5", "4", "5", "5", "5"], "selected": false}, {"id": "1709498232014", "text": "The user is easily able to find and access the subtitle appearance menu.", "answers": ["4", "5", "4", "4", "5", "5", "4", "4", "4", "4", "4", "5", "5"], "selected": false}, {"id": "1709497960285", "text": "If you disagree with any of the above statements or if you have any additional comments, explain below.", "answers": ["", "", "I only didn't strongly agree because I do not usually watch netflix on computer/laptop, and mainly use same subtitle.", "", "I think this is a great inclusion, and really liked the shortcut for captions as opposed to several clicks for expert users", "I think the 'C' shortcut is great! I think my only feedback is how can you have the interface 'teach' this? Could there be a little hint about this shortcut to help novice users become experts?", "I thought the underline meant this icon was \"selected\"", "I couldn't get out of the CC menu - there was a settings menu icon where the X normally is", "", "N/A", "", "", ""], "selected": false}, {"id": "1709498268585", "text": "The subtitle appearance menu offers enough customization options for captions (font and font size).", "answers": ["4", "5", "5", "4", "5", "5", "5", "4", "5", "4", "5", "5", "5"], "selected": false}, {"id": "1709498312221", "text": "If you think more options should be added, explain what options and why below.", "answers": ["Subtitle background and font color options", "", "Maybe two different subtitles at once? ... I rarely touch the subtitle section, but for those who prefer multiple, it may be worth having two languages at once appear.", "", "Could potentially also change colors, but I've never done that and think your options are good", "I think maybe having the option to change opacity or color might be interesting. Like if you are watching a show with lots of snow, the white text might be harder to read so changing color.", "", "No this seemed good", "", "Is there a transparency option that would help with customization?", "", "", ""], "selected": false}, {"id": "1709498762004", "text": "The position of the subtitle appearance menu is appropriate.", "answers": ["4", "5", "5", "4", "5", "5", "5", "4", "4", "5", "5", "4", "5"], "selected": false}, {"id": "1709498835075", "text": "If you disagree that the location of the menu is appropriate, explain why or offer an alternative below.", "answers": ["", "", "", "", "N/A", "", "", "", "", "N/A", "", "", ""], "selected": false}, {"id": "1709498389399", "text": "Add any additional comments or suggestions below.", "answers": ["", "Not sure if \"C\" or \"S\" would be the shortcut for captions/subtitles but overall great job! I like the idea!", "Cool features, good presentation.", "", "Great job, I've struggled with this before and your prototype is a very clean example of how to better the user's experience", "", "", "Looks good", "", "Good job! Just wondering if other users would be able to know about the shortcut 'c'.", "This gives a lot more customization that I like as a user. Very intuitive", "", ""], "selected": false}]